# Создайте пакет с всеми модулями, которые вы создали за время занятия.
# Добавьте в __init__ пакета имена модулей внутри дандер __all__.
# В модулях создайте дандер __all__ и укажите только те функции,
# которые могут верно работать за пределами модуля.

from paket import task_6_07

a = task_6_07._vis_year('01.01.2002')

print(a)
